# Задача 1: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input())
num3 = n % 10
num1 = n // 100
num2 = (n - num1*100 - num3)/ 10
sum = (num1 + num2 + num3)
print(sum)